[
    {
    "title": "Wearable Devices and Body Response",
    "year": "2025",
    "image": "../images/wearables.png",
    "description": "This project explored wearable devices and how they can be used to visualize physiological responses. The data comes from a study that measured heart rate, skin temperature, and other attribues of participants during different stress conditions.",
    "url": "https://ferdgitucsd.github.io/wearables/"
    },
    {
      "title": "Bikewatching Visualization",
      "year": "2025",
      "image": "../images/bikewatching.png",
      "description": "An interactive map visualization of bike traffic in the Boston area during different times of the day. The data comes from Bluebikes publicly-available bicycle sharing program in the Boston area.",
      "url": "https://ferdgitucsd.github.io/bikewatching/"
    },
    {
      "title": "Power Outage Analysis",
      "year": "2024",
      "image": "https://fdanese.github.io/power-outages/assets/confusion_matrix_final_model.png",
      "description": "My final project for DSC 80, where I analyzed power outage data to find trends in time and location. The project included extensive data cleaning, exploratory data analysis, statistical inference, and predictive modeling.",
      "url": "https://fdanese.github.io/power-outages/"
    },
    {
      "title": "My First Website",
      "year": "2025",
      "image": "../images/website.png",
      "description": "This is the page you're looking at right now! This was my first time creating a website from scratch, and I learned a lot about HTML, CSS, and JavaScript in the process. I will continue to update it as I complete projects.",
      "url": "https://ferdgitucsd.github.io/portfolio/"
    },
    {
      "title": "Analysis of Loan Data and Patterns",
      "year": "2024",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "Analyzed and processed a rich dataset of loan applications to identify patterns and anomalies, including implementing functions to detect logical paradoxes in the data. Applied data visualization techniques to explore trends.",
      "url": "#"
    },
    {
      "title": "Basic Song Recommender",
      "year": "2023",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "Implemented a song recommender system using Python and pandas for analyzing Spotify data on Taylor Swift's discography; implemented features like song recommendations based on user preferences and a lyric search tool to identify songs by lyric matches.",
      "url": "#"
    },
    {
      "title": "Basic Image Processing Tool",
      "year": "2023",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "Developed a Python-based image processing application, implementing advanced features like color manipulation, image rotation, and a K-Nearest Neighbors classifier without external libraries.",
      "url": "#"
    },
    {
      "title": "Analysis of the Global Data Science Community",
      "year": "2024",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "Using the 2020 Kaggle Machine Learning & Data Science Survey, this project explored programming language trends, education-job role relationships, and industry compensation patterns. A regression model analyzed key factors influencing salaries, highlighting the complexity of data science career trajectories.",
      "url": "#"
    },
    {
      "title": "Analyzing Social Mobility and Political Ideology",
      "year": "2024",
      "image": "https://dsc106.com/labs/lab02/images/empty.svg",
      "description": "This homework examined the relationship between social mobility and political ideology using economic and voting data. I applied regression analysis and hypothesis testing to identify correlations and geographic trends, gaining insights into how economic opportunity aligns with political preferences.",
      "url": "#"
    }
  ]
  